Autodesk.Revit.DB.IFC.IFCFile.IsValidFile
True if ODA filePtr is valid.
Since:
2020

Autodesk.Revit.DB.IFC.IFCFile.Read(Autodesk.Revit.DB.IFC.IFCFileReadOptions)
Reads content from a file of IFC format.
readOptions:
The IFC file read options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014